{
  "_name_or_path": "allenai/scibert_scivocab_uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Resources and Evaluation",
    "1": "Interpretability and Analysis of Models for NLP",
    "2": "Ethics, Bias, and Fairness",
    "3": "Language Modeling",
    "4": "Information Retrieval and Text Mining",
    "5": "Multimodality and Language Grounding to Vision, Robotics and Beyond",
    "6": "Discourse and Pragmatics",
    "7": "NLP Applications",
    "8": "Computational Social Science and Cultural Analytics",
    "9": "Sentiment Analysis, Stylistic Analysis, and Argument Mining",
    "10": "Machine Learning for NLP",
    "11": "Efficient/Low-Resource Methods for NLP",
    "12": "Special Theme: Generalization of NLP Models",
    "13": "Dialogue and Interactive Systems",
    "14": "Information Extraction",
    "15": "Multilinguality and Language Diversity",
    "16": "Generation",
    "17": "Question Answering",
    "18": "Linguistic theories, Cognitive Modeling and Psycholinguistics",
    "19": "Machine Translation",
    "20": "Speech recognition, text-to-speech and spoken language understanding",
    "21": "Human-Centered NLP",
    "22": "Semantics: Lexical and Sentence-Level",
    "23": "Summarization",
    "24": "Syntax: Tagging, Chunking and Parsing",
    "25": "Phonology, Morphology and Word Segmentation"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Computational Social Science and Cultural Analytics": 8,
    "Dialogue and Interactive Systems": 13,
    "Discourse and Pragmatics": 6,
    "Efficient/Low-Resource Methods for NLP": 11,
    "Ethics, Bias, and Fairness": 2,
    "Generation": 16,
    "Human-Centered NLP": 21,
    "Information Extraction": 14,
    "Information Retrieval and Text Mining": 4,
    "Interpretability and Analysis of Models for NLP": 1,
    "Language Modeling": 3,
    "Linguistic theories, Cognitive Modeling and Psycholinguistics": 18,
    "Machine Learning for NLP": 10,
    "Machine Translation": 19,
    "Multilinguality and Language Diversity": 15,
    "Multimodality and Language Grounding to Vision, Robotics and Beyond": 5,
    "NLP Applications": 7,
    "Phonology, Morphology and Word Segmentation": 25,
    "Question Answering": 17,
    "Resources and Evaluation": 0,
    "Semantics: Lexical and Sentence-Level": 22,
    "Sentiment Analysis, Stylistic Analysis, and Argument Mining": 9,
    "Special Theme: Generalization of NLP Models": 12,
    "Speech recognition, text-to-speech and spoken language understanding": 20,
    "Summarization": 23,
    "Syntax: Tagging, Chunking and Parsing": 24
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.48.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31090
}
